src/InformationRegisters/уатНоменклатураГСМ/уатНоменклатураГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНоменклатураГСМ</name>
  <comment>Доп. сведения для ГСМ</comment>
  <resources>
    <name>ВестиУчетОстатковТЖ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаГСМ</name>
    <type>
      <types>EnumRef.уатГруппыГСМ</types>
    </type>
  </resources>
  <resources>
    <name>ГСМТалона</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЛитровыйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НоминалТалона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/уатНоменклатураГрузов/уатНоменклатураГрузов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНоменклатураГрузов</name>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаГруза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Класс</name>
    <comment>Класс груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТемператураДо</name>
    <comment>Значение конца диапазона температуры в градусах цельсия хранения/транспортировки груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТемператураОт</name>
    <comment>Значение начала диапазона температуры в градусах цельсия хранения/транспортировки груза</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/уатГруппыГСМ/уатГруппыГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатГруппыГСМ</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>ПрисадкиИТехническиеЖидкости</name>
  </enumValues>
  <enumValues>
    <name>Талон</name>
  </enumValues>
  <enumValues>
    <name>Топливо</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМасло</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеДанныеСкрыты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Позывной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/уатЗащищенныеФункцииКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Управление автотранспортом.
// 
// Защищенные функции клиенсткого контекста.
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

#Область ПроцедурыФункцииОткрытияОбъектов

// Процедура проверки защиты при событии "При открытии" формы списка справочника 
//
Процедура уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметры) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента справочника
//
Процедура уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка документа
//
Процедура уатДокументФормаСпискаПриОткрытии(Отказ, Форма, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Форма, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы элемента документа
//
Процедура уатДокументФормаЭлементаПриОткрытии(Отказ, Форма, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Форма, ДопПараметры);
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы обработки
//
Процедура уатОбработкаФормаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
	// Фиксация замера производительности
	ИмяФормы = Неопределено;
	ДопПараметры.Свойство("ИмяФормы",ИмяФормы);
	Если ИмяФормы <> Неопределено Тогда
		ИмяКлючевойОперации = "ОткрытиеФормы." + уатОбщегоНазначенияКлиентСервер.ОбрезатьИмяФормы(ИмяФормы);
		ОценкаПроизводительностиКлиент.ЗамерВремени(ИмяКлючевойОперации);
	КонецЕсли;	
	
КонецПроцедуры

// Процедура проверки защиты при событии "При открытии" формы списка регистра
//
Процедура уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметры = Неопределено) Экспорт
	
	уатФормаПриОткрытии(Отказ, Неопределено, ДопПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыФункцииРаботыСГСМ

// Выбор номенклатуры из регистра сведений НоменклатураГСМ
// Параметры: ГруппаГСМ
// Возвращаемое значение: Справочник-ссылка Номенклатура
Процедура ВыбратьГСМ(ГруппаГСМ = Неопределено, ДополнительныеПараметры = Неопределено, ПроцедураОписаниеОповещения = Неопределено) ЭКСПОРТ
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВыборГСМ", Истина);
	
	Если ЗначениеЗаполнено(ГруппаГСМ) Тогда
		ПараметрыФормы.Вставить("ГруппаГСМ", ГруппаГСМ);
	Иначе
		ПараметрыФормы.Вставить("ГруппаГСМ", ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"));
	КонецЕсли;
	
	КлючУникальности = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ЗначениеГСМДоИзменения") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.ЗначениеГСМДоИзменения);
		ИначеЕсли ДополнительныеПараметры.Свойство("НачальноеЗначениеВыбора") Тогда
			ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", ДополнительныеПараметры.НачальноеЗначениеВыбора);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("УчитыватьТЖ") И ДополнительныеПараметры.УчитыватьТЖ Тогда
			ПараметрыФормы.Вставить("УчитыватьТЖ", ДополнительныеПараметры.УчитыватьТЖ);
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("КлючУникальности") Тогда
			КлючУникальности = ДополнительныеПараметры.КлючУникальности;
		КонецЕсли;
		Если ДополнительныеПараметры.Свойство("Отбор") Тогда 
			ПараметрыФормы.Вставить("Отбор", ДополнительныеПараметры.Отбор);
		КонецЕсли;
	КонецЕсли;
		
	ОткрытьФорму("РегистрСведений.уатНоменклатураГСМ.ФормаСписка", ПараметрыФормы,,КлючУникальности,,, ПроцедураОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // уатВыбратьГСМ 

// Возвращает форму списка ГСМ
Процедура СписокГСМдляТС(Организация, ТС, ГруппаГСМ, БезАналогов = Ложь, УчитыватьТЖ = Ложь, ПроцедураОписаниеОповещения = Неопределено) ЭКСПОРТ
	ПараметрыФормы = Новый Структура("ГруппаГСМ, ТС, Организация, БезАналогов, УчитыватьТЖ", ГруппаГСМ, ТС, Организация, БезАналогов, УчитыватьТЖ);
	ОткрытьФорму("ОбщаяФорма.уатСписокГСМ", ПараметрыФормы,,,,, ПроцедураОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры // уатСписокГСМдляТС

#КонецОбласти

#Область ПроцедурыФункцииРаботыСГрузами

// Выбор номенклатуры из регистра сведений НоменклатураГСМ
// Параметры: ГруппаГСМ
// Возвращаемое значение: Справочник-ссылка Номенклатура
Процедура ДиалогВыбораГруза(Элемент, Номенклатура, ВладелецФормы, СтандартнаяОбработка, ДопПараметры = Неопределено) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, Номенклатура);
	// установим необходимые отборы
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ПараметрыОтбора") Тогда
		ПараметрыФормы.Вставить("Отбор", ДопПараметры.ПараметрыОтбора);
	КонецЕсли;
	ОткрытьФорму("РегистрСведений.уатНоменклатураГрузов.Форма.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
КонецПроцедуры // уатДиалогВыбораГруза       

#КонецОбласти

#Область ПроцедурыФункцииРаботыССотрудниками

// Выбор сотрудника/водителя из спр. Сотрудники с помощью форм обработки уатСотрудники
// Параметры:
//	- Элемент, связанный с сотрудником
//	- ТекСотрудник, ссылка на данные сотрудника
//	- ПараметрыОтбора, структура отбора
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ДиалогВыбораСотрудника(Элемент, ТекСотрудник, ПараметрыОтбора, СтандартнаяОбработка) ЭКСПОРТ
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора, НачальноеЗначениеВыбора", Истина, ТекСотрудник);
	// установим необходимые отборы
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	КонецЕсли;
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаСписка", ПараметрыФормы, Элемент);
КонецПроцедуры

// Открытие формы элемента сотрудника/водителя из спр. Сотрудники с помощью формы обработки уатСотрудники
// Параметры:
//	- ТекСотрудник, ссылка на данные сотрудника
//	- СтандартнаяОбработка, переданный параметр обработчика НачалоВыбора
//
Процедура ОткрытьФормуСотрудника(ТекСотрудник, СтандартнаяОбработка) ЭКСПОРТ
	Если НЕ ЗначениеЗаполнено(ТекСотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", ТекСотрудник);
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область Проверка_ИТС_Отраслевой

Функция ИТСОтраслевой_ПроверкаДоступностиСервисов() Экспорт
	флОК = уатЗащищенныеФункцииСервер.ЕстьПодпискаИТСОтраслевой();
	Если НЕ флОК Тогда
		ОткрытьФорму("ОбщаяФорма.уатПодпискаИТСОтраслевой");
	КонецЕсли;
	
	Возврат флОК;
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Общая процедура проверки защиты при событии "При открытии" всех форм
//
// Параметры:
//  Отказ		 - 	 - 
//  Форма		 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура уатФормаПриОткрытии(Отказ, Форма, ДопПараметры)
	
	Если ДопПараметры = Неопределено Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияКлиент.уатИнициализацияСеансаКлиент(ДопПараметры);
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("Отказ") И ДопПараметры.Отказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Форма = Неопределено Тогда
		ФормаЭлементЗаписать = Форма.Элементы.Найти("ФормаЗаписать");
		Если Не ФормаЭлементЗаписать = Неопределено Тогда 
			ФормаЭлементЗаписать.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
		ФормаЭлементПровести = Форма.Элементы.Найти("ФормаПровести");
		Если Не ФормаЭлементПровести = Неопределено Тогда 
			ФормаЭлементПровести.Отображение = ОтображениеКнопки.Картинка;
		КонецЕсли;
		
		ФормаЭлементСоздатьНаОсновании = Форма.Элементы.Найти("ФормаСоздатьНаОсновании");
		Если Не ФормаЭлементСоздатьНаОсновании = Неопределено Тогда 
			ФормаЭлементСоздатьНаОсновании.Отображение = ОтображениеКнопки.Картинка;
			ФормаЭлементСоздатьНаОсновании.Картинка = БиблиотекаКартинок.уатПодменюВводаНаОсновании;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
